[
  {
    "begin": "06/2024",
    "end": "Present",
    "title": "Mechanical Engineering Intern",
    "company": "Draper Laboratory",
    "company_link": "https://www.draper.com/",
    "description": "Led mechanical and software design of a Low-SWaP rover to traverse a simulated lunar environment. Developed the autonomy stack in ROS2 and designed and manufactured the chassis. Created and implemented an automated testing routine using MATLAB and LabVIEW to characterize an image sensor's performance. Designed 1:1 showpiece of a military navigation system printed on a polyjet printer. Generated shock isolator mounting concepts in Solidworks for a highly SWaP constrained system.",
    "tags": [
      "ROS2",
      "Solidworks",
      "MATLAB",
      "LabVIEW",
      "Mechanical Design",
      "Autonomy"
    ]
  },
  {
    "begin": "08/2023",
    "end": "12/2023",
    "title": "Consultant",
    "company": "Steam Instruments, Inc",
    "company_link": "https://www.steaminstruments.com/",
    "description": "Developed part numbering system and implemented OpenBOM PLM software to track and manage parts and CAD data. Investigated central optic failure using Solidworks FEA and designed a support solution to prevent future failures.",
    "tags": [
      "Solidworks",
      "OpenBOM",
      "PLM",
      "FEA"
    ]
  },
  {
    "begin": "05/2021",
    "end": "12/2022",
    "title": "Mechanical Engineering Co-Op",
    "company": "BMW Manufacturing Co.",
    "company_link": "https://www.bmwusfactory.com/",
    "description": "Created a Python GUI to visualize a computer vision system's adjustments for stud gun robot calibration, improving quality control. Planned and implemented an internal change management website using Oracle APEX and SQL Developer. Developed work scopes and oversaw the installation of utilities around the Body Shop for new model integration. Designed a conveyor chain brush that contributed to a six Production Associate headcount reduction.",
    "tags": [
      "Python",
      "Oracle APEX",
      "SQL",
      "Mechanical Design",
      "Automation",
      "Process Improvement"
    ]
  },
  {
    "begin": "03/2019",
    "end": "10/2020",
    "title": "Mechanical Engineering Intern",
    "company": "Steam Instruments, Inc",
    "company_link": "https://www.steaminstruments.com/",
    "description": "Designed parts and managed assemblies in Solidworks for a prototype protein sensor. Designed parts for prototypes, including a radiation shield, sensor mounts, and UHV components. Created parts for a laser ablation attachment for mass spectrometers.",
    "tags": [
      "Solidworks",
      "Autodesk Inventor",
      "Mechanical Design",
      "Prototyping"
    ]
  },
  {
    "begin": "01/2024",
    "end": "Present",
    "title": "MS Researcher",
    "company": "Assistive Robotics and Manipulation Lab, Stanford University",
    "company_link": "https://armlab.stanford.edu/",
    "description": "Integrated DenseTact visual-tactile sensors into a robotic hand and developed ROS2 nodes for its operation. Created a teleoperation framework to control the robotic hand and Kinova Gen3 arm using a SpaceMouse and visual hand tracking.",
    "tags": [
      "ROS2",
      "Teleoperation",
      "Tactile Sensors",
      "Kinova Gen3",
      "Robotics"
    ]
  }
]
